# coding=utf8

owx_extractor_map = {
    "company": [u'企业或单位（业主）名称', u'企业或单位名称', u'纳税人名称', u'企业单位名称', u'企业、单位名称'],
    "taxpayer_id": [u'纳税人识别号'],
    "legal_man": [u'法定代表人或负责人姓名', u'法定代表人', u'法定代表人（负责人）姓名', u'法定代表人、负责人姓名', u'法定代表人或负责人姓名（业主姓名）'],
    "legal_man_id": [u'居民身份证或其他有效身份证件号码', u'法定代表人证件号码'],
    "business_address": [u'经营地点', u'生产经营地址', u'经营地址'],
    "tax_item": [u'欠税税种'],
    "owing_tax_cur_period": [u'当期新发生的欠税金额', u'其中：本年欠税余额', u'各税合计', u'当期新欠金额', u'其中：当季新发生的欠税金额', u'当期新欠额'],
    "owing_tax": [u'欠税余额', u'累计欠税余额', u'各税合计2', u'欠税金额（单位：万元）', u'欠税余额（万元）'],
    "tax_authority": [u'县级地方税务局', u'税务机关名称'],
    "owing_date": [u'欠税统计截止期', u'认定日期', u'欠税所属期'],
    "taxpayer_name": [u'企业或单位（业主）名称', u'企业或单位名称', u'纳税人名称', u'企业单位名称', u'企业、单位名称'],

}

owx_find_head_keyword_map = {
    u"广东": u"纳税人识别码",
    u"福建": u"纳税人识别号",
    u"佛山": u"纳税人识别号",
    u"河北": u"纳税人识别号",
    u"山东": u"纳税人识别号",
    u"深圳": u"纳税人识别号",
    u"厦门": u"纳税人识别号",
}
