#coding=utf8

litigant_replace_str_list = [
    u'破产清算',
    u'破产重整',
    u'破产管理',
    u'申请你公司',
    u'申请宣告被',
    u'一案公告中',
    u'承兑汇票',
    u'持有的',
    u'公告中'
    u'被告',
    u'被告为',
    u'诉被上',
    u'债务人',
    u'债权人',
    u'所持',
    u'申请',
    u'强制',
    u'请求',
    u'丢失',
    u'了',
    u'因',
    u'的',

]

plaintiff_keyword_list = [
    u'原告人',
    u'案外人',
    u'异议人',
    u'自诉人',
    u'公诉人',
    u'上诉人',
    u'申诉人',
    u'起诉人',
    u'申请人',
    u'申报人',
    u'请求人',
    u'执行人',
    u'复议人',
    u'异议人',
    u'再审人',
    u'请求人',
    u'申请单位',
    u'执行单位',
    u'被害单位',
    u'移送部门',
    u'公诉机关',
    u'抗诉机关',
    u'执行机关',
    u'利害关系人',
    u'原告',
    u'（）',
]

defendant_keyword_list = [
    u'（被申请人）'
    u'异议相对人',
    u'罪犯',
    u'被告人',
    u'被上诉人',
    u'被起诉人',
    u'被申诉人',
    u'被申请人',
    u'被执行人',
    u'被请求人',
    u'被申请执行人',
    u'赔偿义务机关',
    u'诉前保全申请人',
    u'被告',
    u'第三人',
    u'执行异议之',

]

bulletin_type_list = [
    u"裁判文书",
    u"起诉状副本及开庭传票",
    u"破产文书",
    u"起诉状、上诉状副本",
    u"开庭传票",
    u"执行文书",
    u"更正",
    u"司法鉴定书",
    u"公示催告",
    u"宣告失踪、死亡",
    u"仲裁文书",
    u"清算公告",
    u"行政处罚通知书",
    u"公益诉讼",
    u"遗失声明",
]

defendant_pattern_list = [
    u"被执行人(\S+?)房产拍卖公告",
    u"被告为(\S+?)的公告"
]