# coding=utf8

bid_type_keyword_list = [
    ('中标结果', '中标'),
    ('中标公告', '中标'),
    ('中标', '中标'),
    ('成交', '中标'),
    ('成交公告', '中标'),
    ('成交结果公告', '中标'),
    ('采购结果', '中标'),
    ('招标结果', '中标'),
    ('结果公告', '中标'),
    ('竞价结果', '中标'),
    ('项目结果', '中标'),
    ('评审结果', '中标'),
    ('施工结果', '中标'),
    ('评标结果', '中标'),
    ('项目合同公告', '中标'),
    ('中选', '中标'),
    ('招标撤销', '废标'),
    ('招标失败', '废标'),
    ('招标公告', '招标'),
    ('采购项目', '招标'),
    ('项目公告', '招标'),
    ('采购安装项目', '招标'),
    ('意见回复', '招标'),
    ('重招', '招标'),
    ('工程', '招标'),
    ('项目', '招标'),
    ('招标', '招标'),

]

bid_type_zhongbiao_keyword_list = [
    '成交供应商',
    '中标单位',
    '中标供应商',
    '中标（成交）供应商',
    '中签单位',
    '中标人',
    '成交人',
    '成交单位',
    '中标企业',
    '中标结果',
    '中标商',

]

bid_budget_keyword_list = [
    '预算资金',
    '预算金额',
    '预算价',
    '承包',
    '项目估算',
    '招标金额',
    '投标最高限价',
    '招标总投资',
    '评标价',
    '投标总报价',
    '投资约为',
    '招标控制价',
    '招标规模',
    '项目概算',
    '项目总投资',
    '投资金额',
    '标底价',
    '总投资合计',
]

bid_money_keyword_list = [
    '中标金额',
    '成交金额',
    '中标价',
    '中标合同额',
    '合同金额',
    '中标服务费金额',
    '成交总价',
    '中选金额',
    '中标（成交）金额',
    '成交价',
    '中标总金额',
    '成交标的金额',
    '投标价',
    '报价总金额',
    '报价',
    '价格',
    '中标总价'
    '标价',

]

zhaobiao_company_keyword_list = [
    '采购单位',
    '采购商',
    '招标人',
    '招标单位',
    '建设单位',
    '采购人',
    '项目单位',
    '招租人 ',
    '采购项目名称',
    '招标（采购）人',

]

houxuanzhongbiao_company_keyword_list = [
    '成交候选供应商',
    '中标候选人',
    '成交候选人',
    '一标段',
    '二标段',
    '三标段',
    '四标段',
    '五标段',
    '六标段',
]

zhongbiao_company_keyword_list = [
    '成交供应商',
    '中标单位',
    '中标供应商',
    '中标（成交）供应商',
    '中签单位',
    '中标人',
    '成交人',
    '发布结果',
    '成交单位',
    '中标企业',
    '中标结果',
    '中标商',


]

agent_keyword_list = [
    '代理机构',
    '代理人',
    '招标代理',
    '代理公司',
    '采购代理',
    '采购机构名称',
    '采购代理机构'
    '发布机构',

]

company_pattern_list = [
    '(\S*)受(\S+)委托',
]

zhaobiao_company_end_list = [
    '小学',
    '中学',
    '大学',
    '幼儿园',
    '学校',
    '学院',
    '委员会',
    '监狱',
    '银行',
    '集团',
    '政府',
    '院',
    '局',
    '司',
    '所',
    '厅',
    '委',
    '馆',
    '示范区',
    '开发区',
    '中心',
    '检查场',
    '油田',
    '气象台',
    '商务厅',
    '厂',
    '图书馆',
    '办事处',
    '管理站',
    '大队',
    '监测站',
    '合作联社',
    '推广站 ',
    '管理处',
    '博物馆',
    '文化馆',
    '经营总站 ',
    '卫计办',
    '办公室',
    '园林处',
    '管理段',
    '一中',
    '总站',
    '管理队',

]

zhongbiao_company_end_list = [
    '公司',
    '研究所',
    '商城',
    '园艺场',
    '设计院',
    '研究院',
    '工程处',
    '商行',
    '厂',
    '中心',
    '渔场',
    '门诊部',
    '事务所',
]

agent_company_end_list = [
    '公司',
    '工程处',
    '中心',
]

address_keyword_list = [
    '地址',
    '地点',
]

phone_keyword_list = [
    '电话',
    '联系方式',
    '联系号码',
]

bid_close_keyword_list = [
    '评标日期',
    '报价日期',
    '开标日期',
    '开标时间',
    '评标时间',
    '报价时间',
    '报价截止时间',
    '报价截止日期',
    '投标截止时间',
    '投标截止日期',
    '报名截止时间',
    '报名截止日期',
    '谈判时间',
    '谈判日期',
    '递交截止时间',
    '递交截止日期',
    '递交的截止时间',
    '递交的截止日期',
    '递交响应文件时间',
    '递交响应文件日期',
    '谈判（开启）时间',
    '定标日期',
    '申请文件的截止时间',
    '申请文件的截止日期',
    '定标时间',
    '磋商日期',
    '磋商时间',
    '磋商会议时间',
    '磋商会议日期'
    '投标文件截止时间',
    '投标文件截止日期',
]
