#coding=utf8

court_place_replace_str_list = [
    u'（科技法庭',
    u'本院',
    u'依法公开开庭',
    u'依法',
    u'公开开庭',
    u'开庭',
]

week_day_list = [
    u'（星期一）',
    u'（星期二）',
    u'（星期三）',
    u'（星期四）',
    u'（星期五）',
    u'（星期六）',
    u'（星期日）',
    u'（周一）',
    u'（周二）',
    u'（周三）',
    u'（周四）',
    u'（周五）',
    u'（周六）',
    u'（周日）',
]

litigant_pattern_list = [
            u'关于(\S*?)一案',
            u'提起公与(\S*?)一案',
            u'受理(\S*?)一案',
            u'审理(\S*?)一案',
            u'审理(\S*?)二审案',
            u'受理(\S*?纠纷)',
            u'审理(\S*?纠纷)',
            u'(\S+与\S+)之诉',
            u'(\S+与\S+纠纷)',
            u'(\S+与\S+)一案',
            u'(\S+诉\S+)一案',
            u'(\S+诉\S+纠纷)',
            u'申诉人(\S*?)一案',
            u'被告人(\S*?)一案',
            u'上诉人(\S*?)一案',
            u'审理(\S+)案',
            u'审理(\S+)',
            u'公开宣判(\S+?)案'
]

replace_str_list = [
    u"(原审原告)",
    u"(原审被告)",
    u"（原审被告）",
    u"（原审原告）",
    u"（原审被告人）",
    u'原审被告人',
    u'一审',
    u"（原审第三人）",
    u"(原审第三人)",
    u'第三人',
    u'原审',
    u'抗诉',
    u'涉嫌',
    u'民事',
    u'四案',
    u":",
    u"：",
]

litigants_sep_list = [
    u'上诉',
    u'诉',
    u'指控的',
]

plaintiff_keyword_list = [
    u'原告人',
    u'案外人',
    u'异议人',
    u'自诉人',
    u'公诉人',
    u'上诉人',
    u'申诉人',
    u'起诉人',
    u'申请人',
    u'申报人',
    u'请求人',
    u'执行人',
    u'复议人',
    u'异议人',
    u'再审人',
    u'请求人',
    u'申请单位',
    u'执行单位',
    u'被害单位',
    u'移送部门',
    u'公诉机关',
    u'抗诉机关',
    u'执行机关',
    u'利害关系人',
    u'原告',
]

defendant_keyword_list = [
    u'异议相对人',
    u'罪犯',
    u'被告人',
    u'被上诉人',
    u'被起诉人',
    u'被申诉人',
    u'被申请人',
    u'被执行人',
    u'被请求人',
    u'被申请执行人',
    u'赔偿义务机关',
    u'诉前保全申请人',
    u'被告',
    u'再审',
    u'关于',
    u'一案',
]

format_str_list = [
    u'诉',
    u'原告',
    u'被告',
    u'附带民事讼',
]